<template><div><h2 id="遗传算法-genetic-algorithm-ga-概述" tabindex="-1"><a class="header-anchor" href="#遗传算法-genetic-algorithm-ga-概述"><span>遗传算法（Genetic Algorithm, GA）概述</span></a></h2>
<ul>
<li>
<p>模拟生物在自然环境中遗传和进化过程而形成的自适应全局优化搜索算法</p>
</li>
<li>
<p>鉴了达尔文的进化论和孟德尔的遗传学说</p>
</li>
</ul>
<h2 id="理论基础" tabindex="-1"><a class="header-anchor" href="#理论基础"><span>理论基础</span></a></h2>
<h3 id="模式定理" tabindex="-1"><a class="header-anchor" href="#模式定理"><span>模式定理</span></a></h3>
<ul>
<li>
<p><strong>模式</strong>：具有相似结构特点的个体编码字符串</p>
<p>遗传算法的本质是对模式所进行的一系列运算</p>
<p>长度为L的串，隐含着2^L个不同的模式</p>
</li>
<li>
<p><strong>模式阶</strong>：模式H中确定位置的个数称作该模式的模式阶，记作O(H)</p>
<p>eg. 0*****的模式阶为1</p>
<p>模式阶越高，确定性越高，样本数越少</p>
</li>
<li>
<p><strong>定义距</strong>：在模式H中第一个确定位置和最后一个确定位置之间的距离称为该模式的定义距，记作D(H)</p>
</li>
<li>
<p><strong>模式定理（遗传算法基本定理）</strong>：</p>
<p>在遗传算法选择、交叉和变异的作用下，具有低阶、短定义距，并且其平均适应度高于群体平均适应度的模式在子代中将呈指数级增长</p>
<p>根据模式定理，随着遗传算法一代一代地进行，那些定义距短的、位数少的、高适应度的模式越来越多，因而可期望最后得到的位串的性能越来越得到改善，最终趋向全局最优点</p>
</li>
</ul>
<h3 id="积木块假设" tabindex="-1"><a class="header-anchor" href="#积木块假设"><span>积木块假设</span></a></h3>
<ul>
<li>
<p><strong>积木块</strong> ：具有低阶、短定义距以及高平均适应度的模式称为积木块</p>
<p>模式定理说明了积木块的样本数呈指数级增长</p>
</li>
<li>
<p><strong>积木块假设</strong>：</p>
<p>个体的积木块通过选择、交叉、变异等遗传算子的作用能相互结合在一起，形成高阶、长距、高平均适应度的个体 编码串</p>
<p>积木块假设说明了用遗传算法求解各类问题的基本思想，即通过基因块之间的相互拼接能够产生出问题的更好的解，最终生成全局最优解</p>
<h3 id="总结" tabindex="-1"><a class="header-anchor" href="#总结"><span>总结</span></a></h3>
<p>从遗传算法的模式定理得到:具有高适应度、低阶、短定义矩的模式的数量会在种群的进化中呈指数级增长，从而保证了算法获得最优解的一个必要条件。而另一方面，积木块假设则指出:遗传算法有能力使优秀的模式向着更优的方问进化，即遗传算法有能力搜索到全局最优解。</p>
<h2 id="基本概念" tabindex="-1"><a class="header-anchor" href="#基本概念"><span>基本概念</span></a></h2>
</li>
</ul>
<table>
	<tr>
	    <th>术语</th>
	    <th>含义</th> 
	</tr >
  <tr>
	    <td>群体</td>
	    <td>可行解集</td>
	</tr>
  <tr>
	    <td>个体</td>
	    <td>可行解</td>
	</tr>
	<tr>
	    <td>染色体</td>
	    <td>可行解编码</td>
	</tr>
  	<tr>
	    <td>基因</td>
	    <td>可行解编码的分量</td>
	</tr>
    	<!-- <tr>
	    <td rowspan="3">遗传编码</td>
	    <td>二进制编码：操作方便，计算简单；位串长度越长，精度越高。一般来说，编码精度越高，所得到的解的质量也越高，意味着解更为优良;但同时，由于遗传操作所需的计算量也更大，因此算法的耗时将更长。</td>
	</tr>
  	</tr>
    	<tr>
	    <td>实数编码：计算精确度高，便于和经典连续优化算法结合，适用于数值优化问题;但其缺点是适用范围有限，只能用于连续变量问题，。
      </td>
	</tr> -->
</table>
</div></template>


